In [1]:
import pandas as pd
import numpy as np

In [4]:
f2015=pd.read_csv(r"D:\temp\Fortune_500_2015.csv",usecols=["rank","company"])

In [5]:
f2016=pd.read_csv(r"D:\temp\Fortune_500_2016.csv",usecols=["rank","company"])

In [35]:
companies20152016=f2015.merge(f2016,on="company",how="outer",suffixes=["_2015","_2016"],indicator=True)

In [40]:
companies20152016[companies20152016['_merge']=="both"]

     rank_2015                company  rank_2016 _merge
0          1.0                Walmart        1.0   both
1          2.0            Exxon Mobil        2.0   both
2          3.0                Chevron       14.0   both
3          4.0     Berkshire Hathaway        4.0   both
4          5.0                  Apple        3.0   both
..         ...                    ...        ...    ...
492      493.0    Insight Enterprises      474.0   both
493      494.0  Alliance Data Systems      404.0   both
494      495.0       LifePoint Health      430.0   both
496      497.0      Wyndham Worldwide      466.0   both
497      498.0          Owens Corning      480.0   both

[466 rows x 4 columns]

In [27]:
companies20152016.loc[0]["company"] in companies20152016.company.to_list()

True

In [28]:
f2015

     rank                    company
0       1                    Walmart
1       2                Exxon Mobil
2       3                    Chevron
3       4         Berkshire Hathaway
4       5                      Apple
..    ...                        ...
495   496  Pioneer Natural Resources
496   497          Wyndham Worldwide
497   498              Owens Corning
498   499                  Alleghany
499   500      McGraw Hill Financial

[500 rows x 2 columns]